src/cf/InformationRegisters/GDS_СоответсвиеДокументовПисьмам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_СоответсвиеДокументовПисьмам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогOCR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеOCRСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GDS_ЗаправочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_СоответсвиеДокументовПисьмам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДокументПоПисьму(Письмо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Письмо", Письмо);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_СоответсвиеДокументовПисьмам.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.GDS_СоответсвиеДокументовПисьмам КАК GDS_СоответсвиеДокументовПисьмам
	|ГДЕ
	|	GDS_СоответсвиеДокументовПисьмам.Письмо = &Письмо";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьСоответсвие(Документ, Письмо, Успех = Ложь, ТекстОшибки = "", ЛогOCR = "", ДанныеOCRСтрока = "") Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.Письмо = Письмо;
	Запись.Успех = Успех;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.ЛогOCR = ЛогOCR;
	Запись.ДанныеOCRСтрока = ДанныеOCRСтрока;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
